app/Models/Historia.php

SELECT *
FROM `categoria`
---
    public function getCategorias() {
        $perfil = [];
        $db      = \Config\Database::connect();
        $builder = $db->table('categoria')->select('*');
        $res = $builder->get()->getResult();