app/Models/Usuario.php

    public function login($datos) {


        $db      = \Config\Database::connect();
        $builder = $db->table('usuario')->select('*')->where('Usuario', $datos['usuario'])->where('Clave', $datos['clave']);
        $res = $builder->get()->getRow();
---
SELECT *
FROM `usuario`
WHERE `Usuario` = 'asd'
AND `Clave` = 'asd'

    public function getPerfil($idUsuario) {
        $perfil = [];
        if($idUsuario > 0) {
            $db      = \Config\Database::connect();
            $builder = $db->table('usuario')->select('*')->where('Id', $idUsuario);
            $res = $builder->get()->getRow();
---
SELECT *
FROM `usuario`
WHERE `Id` = '2'